"""
Послідовність складається з цілих чисел і закінчується номером 0.
Визначте, скільки елементів цієї послідовності більше наступного
елемента. Вводиться послідовність цілих чисел, що закінчується числом 0
(саме число 0 в послідовність не входить, а використовується як ознака
її закінчення). Гарантується, що послідовність містить як мінімум два
числа.

Автор: Савченко Валентина 31І група
"""
num = int(input("Введіть ціле число (0 кінець послідовності): "))

count_bigger = 0

while num != 0:
    num_next = int(input("Введіть ціле число (0 кінець послідовності): "))
    if num_next == 0:
        break
    if num > num_next:
        count_bigger += 1
    num = num_next
    
print(f"Кількість елементів, які більше наступного: {count_bigger}")
